RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_CCM.h
#define CCM_LPCG_STATUS1_CPU3_MODE_MASK          (0x3000U)
#define CCM_LPCG_STATUS1_CPU3_MODE_SHIFT         (12U)
/*! CPU3_MODE - Domain3 Low Power Mode
 *  0b00..Run
 *  0b01..Wait
 *  0b10..Stop
 *  0b11..Suspend
 */
#define CCM_LPCG_STATUS1_CPU3_MODE(x)            (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU3_MODE_SHIFT)) & CCM_LPCG_STATUS1_CPU3_MODE_MASK)

#define CCM_LPCG_STATUS1_CPU3_MODE_REQUEST_MASK  (0x4000U)
#define CCM_LPCG_STATUS1_CPU3_MODE_REQUEST_SHIFT (14U)
/*! CPU3_MODE_REQUEST - Domain3 request enter Low Power Mode
 *  0b0..No request
 *  0b1..Request from domain to enter Low Power Mode
 */
#define CCM_LPCG_STATUS1_CPU3_MODE_REQUEST(x)    (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU3_MODE_REQUEST_SHIFT)) & CCM_LPCG_STATUS1_CPU3_MODE_REQUEST_MASK)

#define CCM_LPCG_STATUS1_CPU3_MODE_DONE_MASK     (0x8000U)
#define CCM_LPCG_STATUS1_CPU3_MODE_DONE_SHIFT    (15U)
/*! CPU3_MODE_DONE - Domain3 Low Power Mode task done
 *  0b0..Clock is not gated
 *  0b1..Clock is gated-off
 */
#define CCM_LPCG_STATUS1_CPU3_MODE_DONE(x)       (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CPU3_MODE_DONE_SHIFT)) & CCM_LPCG_STATUS1_CPU3_MODE_DONE_MASK)

#define CCM_LPCG_STATUS1_TARGET_SETPOINT_MASK    (0xF0000U)
#define CCM_LPCG_STATUS1_TARGET_SETPOINT_SHIFT   (16U)
/*! TARGET_SETPOINT - Next Setpoint to change to */
#define CCM_LPCG_STATUS1_TARGET_SETPOINT(x)      (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_TARGET_SETPOINT_SHIFT)) & CCM_LPCG_STATUS1_TARGET_SETPOINT_MASK)

#define CCM_LPCG_STATUS1_CURRENT_SETPOINT_MASK   (0xF00000U)
#define CCM_LPCG_STATUS1_CURRENT_SETPOINT_SHIFT  (20U)
/*! CURRENT_SETPOINT - Current Setpoint */
#define CCM_LPCG_STATUS1_CURRENT_SETPOINT(x)     (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_CURRENT_SETPOINT_SHIFT)) & CCM_LPCG_STATUS1_CURRENT_SETPOINT_MASK)

#define CCM_LPCG_STATUS1_SETPOINT_OFF_REQUEST_MASK (0x1000000U)
#define CCM_LPCG_STATUS1_SETPOINT_OFF_REQUEST_SHIFT (24U)
/*! SETPOINT_OFF_REQUEST - Clock gate turn off request from GPC Setpoint
 *  0b0..No request
 *  0b1..Clock gate requested to be turned off
 */
#define CCM_LPCG_STATUS1_SETPOINT_OFF_REQUEST(x) (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_SETPOINT_OFF_REQUEST_SHIFT)) & CCM_LPCG_STATUS1_SETPOINT_OFF_REQUEST_MASK)

#define CCM_LPCG_STATUS1_SETPOINT_OFF_DONE_MASK  (0x2000000U)
#define CCM_LPCG_STATUS1_SETPOINT_OFF_DONE_SHIFT (25U)
/*! SETPOINT_OFF_DONE - Clock gate turn off finish from GPC Setpoint
 *  0b0..Clock gate is not turned off
 *  0b1..Clock gate is turned off
 */
#define CCM_LPCG_STATUS1_SETPOINT_OFF_DONE(x)    (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_SETPOINT_OFF_DONE_SHIFT)) & CCM_LPCG_STATUS1_SETPOINT_OFF_DONE_MASK)

#define CCM_LPCG_STATUS1_SETPOINT_ON_REQUEST_MASK (0x4000000U)
#define CCM_LPCG_STATUS1_SETPOINT_ON_REQUEST_SHIFT (26U)
/*! SETPOINT_ON_REQUEST - Clock gate turn on request from GPC Setpoint
 *  0b0..No request
 *  0b1..Clock gate requested to be turned on
 */
#define CCM_LPCG_STATUS1_SETPOINT_ON_REQUEST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_SETPOINT_ON_REQUEST_SHIFT)) & CCM_LPCG_STATUS1_SETPOINT_ON_REQUEST_MASK)

#define CCM_LPCG_STATUS1_SETPOINT_ON_DONE_MASK   (0x8000000U)
#define CCM_LPCG_STATUS1_SETPOINT_ON_DONE_SHIFT  (27U)
/*! SETPOINT_ON_DONE - Clock gate turn on finish from GPC Setpoint
 *  0b0..Clock gate is not turned on
 *  0b1..Clock gate is turned on
 */
#define CCM_LPCG_STATUS1_SETPOINT_ON_DONE(x)     (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_STATUS1_SETPOINT_ON_DONE_SHIFT)) & CCM_LPCG_STATUS1_SETPOINT_ON_DONE_MASK)
/*! @} */

/* The count of CCM_LPCG_STATUS1 */
#define CCM_LPCG_STATUS1_COUNT                   (138U)

/*! @name LPCG_CONFIG - LPCG configuration */
/*! @{ */

#define CCM_LPCG_CONFIG_SETPOINT_PRESENT_MASK    (0x10U)
#define CCM_LPCG_CONFIG_SETPOINT_PRESENT_SHIFT   (4U)
/*! SETPOINT_PRESENT - Setpoint present
 *  0b0..Setpoint is not implemented.
 *  0b1..Setpoint is implemented.
 */
#define CCM_LPCG_CONFIG_SETPOINT_PRESENT(x)      (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_CONFIG_SETPOINT_PRESENT_SHIFT)) & CCM_LPCG_CONFIG_SETPOINT_PRESENT_MASK)
/*! @} */

/* The count of CCM_LPCG_CONFIG */
#define CCM_LPCG_CONFIG_COUNT                    (138U)

/*! @name LPCG_AUTHEN - LPCG access control */
/*! @{ */

#define CCM_LPCG_AUTHEN_TZ_USER_MASK             (0x1U)
#define CCM_LPCG_AUTHEN_TZ_USER_SHIFT            (0U)
/*! TZ_USER - User access
 *  0b0..LPCG cannot be changed in user mode.
 *  0b1..LPCG can be changed in user mode.
 */
#define CCM_LPCG_AUTHEN_TZ_USER(x)               (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_TZ_USER_SHIFT)) & CCM_LPCG_AUTHEN_TZ_USER_MASK)

#define CCM_LPCG_AUTHEN_TZ_NS_MASK               (0x2U)
#define CCM_LPCG_AUTHEN_TZ_NS_SHIFT              (1U)
/*! TZ_NS - Non-secure access
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_LPCG_AUTHEN_TZ_NS(x)                 (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_TZ_NS_SHIFT)) & CCM_LPCG_AUTHEN_TZ_NS_MASK)

#define CCM_LPCG_AUTHEN_LOCK_TZ_MASK             (0x10U)
#define CCM_LPCG_AUTHEN_LOCK_TZ_SHIFT            (4U)
/*! LOCK_TZ - lock truszone setting
 *  0b0..Trustzone setting is not locked.
 *  0b1..Trustzone setting is locked.
 */
#define CCM_LPCG_AUTHEN_LOCK_TZ(x)               (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_LOCK_TZ_SHIFT)) & CCM_LPCG_AUTHEN_LOCK_TZ_MASK)

#define CCM_LPCG_AUTHEN_WHITE_LIST_MASK          (0xF00U)
#define CCM_LPCG_AUTHEN_WHITE_LIST_SHIFT         (8U)
/*! WHITE_LIST - Whitelist */
#define CCM_LPCG_AUTHEN_WHITE_LIST(x)            (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_WHITE_LIST_SHIFT)) & CCM_LPCG_AUTHEN_WHITE_LIST_MASK)

#define CCM_LPCG_AUTHEN_LOCK_LIST_MASK           (0x1000U)
#define CCM_LPCG_AUTHEN_LOCK_LIST_SHIFT          (12U)
/*! LOCK_LIST - Lock Whitelist
 *  0b0..Whitelist is not locked.
 *  0b1..Whitelist is locked.
 */
#define CCM_LPCG_AUTHEN_LOCK_LIST(x)             (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_LOCK_LIST_SHIFT)) & CCM_LPCG_AUTHEN_LOCK_LIST_MASK)

#define CCM_LPCG_AUTHEN_DOMAIN_MODE_MASK         (0x10000U)
#define CCM_LPCG_AUTHEN_DOMAIN_MODE_SHIFT        (16U)
/*! DOMAIN_MODE - Low power and access control by domain
 *  0b0..Clock does not work in Domain Mode
 *  0b1..Clock works in Domain Mode
 */
#define CCM_LPCG_AUTHEN_DOMAIN_MODE(x)           (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_DOMAIN_MODE_SHIFT)) & CCM_LPCG_AUTHEN_DOMAIN_MODE_MASK)

#define CCM_LPCG_AUTHEN_SETPOINT_MODE_MASK       (0x20000U)
#define CCM_LPCG_AUTHEN_SETPOINT_MODE_SHIFT      (17U)
/*! SETPOINT_MODE - Low power and access control by Setpoint
 *  0b0..LPCG is not functioning in Setpoint controlled Mode
 *  0b1..LPCG is functioning in Setpoint controlled Mode
 */
#define CCM_LPCG_AUTHEN_SETPOINT_MODE(x)         (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_SETPOINT_MODE_SHIFT)) & CCM_LPCG_AUTHEN_SETPOINT_MODE_MASK)

#define CCM_LPCG_AUTHEN_CPULPM_MASK              (0x40000U)
#define CCM_LPCG_AUTHEN_CPULPM_SHIFT             (18U)
/*! CPULPM - CPU Low Power Mode
 *  0b0..LPCG is not functioning in Low power Mode
 *  0b1..LPCG is functioning in Low Power Mode
 */
#define CCM_LPCG_AUTHEN_CPULPM(x)                (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_CPULPM_SHIFT)) & CCM_LPCG_AUTHEN_CPULPM_MASK)

#define CCM_LPCG_AUTHEN_LOCK_MODE_MASK           (0x100000U)
#define CCM_LPCG_AUTHEN_LOCK_MODE_SHIFT          (20U)
/*! LOCK_MODE - Lock low power and access mode
 *  0b0..MODE is not locked.
 *  0b1..MODE is locked.
 */
#define CCM_LPCG_AUTHEN_LOCK_MODE(x)             (((uint32_t)(((uint32_t)(x)) << CCM_LPCG_AUTHEN_LOCK_MODE_SHIFT)) & CCM_LPCG_AUTHEN_LOCK_MODE_MASK)
/*! @} */

/* The count of CCM_LPCG_AUTHEN */
#define CCM_LPCG_AUTHEN_COUNT                    (138U)


/*!
 * @}
 */ /* end of group CCM_Register_Masks */


/*!
 * @}
 */ /* end of group CCM_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_CCM_H_ */

